app/controllers/games_controller.rb

  def index
    @games = PublishedGame.all
---
SELECT "published_games".* FROM "published_games"

  def load_instance
    @game = PublishedGame.find(params[:id])
---
SELECT  "published_games".* FROM "published_games"  WHERE "published_games"."id" = 1 LIMIT 1