app/controllers/users_controller.rb

SELECT "users".* FROM "users"  WHERE "users"."published" = 't'
---
  def published
    @users = User.where(:published => true)

INSERT INTO "users" ("created_at", "key", "updated_at", "username") VALUES ('2016-01-20 18:36:30.951000', '657657547', '2016-01-20 18:36:30.951000', 'gwink') RETURNING "id"
---
  def create
    @user = User.new(user_params)
    render (@user.save ? :show : :new)

UPDATE "users" SET "key" = '1234567890', "updated_at" = '2016-01-20 18:38:35.279000' WHERE "users"."id" = 1
---
  def update
    if @user.update(user_params)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2 LIMIT 1
---
  def load_instance
    @user = User.find(params[:id])